# Pandas Tutorial

## Import Requirements

In [1]:
import numpy as np
import pandas as pd

### Series

In [2]:
# Example 1: create an empty Series
a = pd.Series()
a

<ipython-input-2-0bd4a0abb2ea>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series()

Series([], dtype: float64)

In [3]:
# Example 2: Create a Series from an ndarray
data = np.array(['a', 'b', 'c', 'd'])
b = pd.Series(data)  # Since we didn't pass an index, the default index in zero based integers
print(data)
print("")
print(b)

['a' 'b' 'c' 'd']

0    a
1    b
2    c
3    d
dtype: object

In [4]:
# Example 3: Create a Series from a dictionary, dictionary keys are used as indices
data = {'a':0, 'b':1, 'c':2}
c = pd.Series(data)
print(data)
print("")
print(c)

{'a': 0, 'b': 1, 'c': 2}

a    0
b    1
c    2
dtype: int64

In [5]:
# Example 4: Create a Series from a dictionary and apply your own indices, notice the unrecognized index is added but its value is NaN
data = {'a':0, 'b':1, 'c':2}
d = pd.Series(data, index=['b', 'c', 'd', 'a'])
print(data)
print("")
print(d)

{'a': 0, 'b': 1, 'c': 2}

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [6]:
# Example 5: Create a Series from a scalar
scalar = 5
e = pd.Series(scalar, index=['0', '1', '2', '3'])
e

0    5
1    5
2    5
3    5
dtype: int64

In [7]:
# Example 6: Accessing data from a Series with it's position, select first value
f = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
print(f)
print("")
f[0]

a    1
b    2
c    3
d    4
e    5
dtype: int64

1

In [8]:
# Example 7: Accessing data from a Series with it's position, select first 3 values
f = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
print(f)
print("")
f[:3]

a    1
b    2
c    3
d    4
e    5
dtype: int64

a    1
b    2
c    3
dtype: int64

In [9]:
# Example 8: Accessing data from a Series with it's position
f = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
print(f)
print("")
f[-3:]

a    1
b    2
c    3
d    4
e    5
dtype: int64

c    3
d    4
e    5
dtype: int64

In [10]:
# Example 9: Accessing data from a Series with it's index (label)
f = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
print(f)
print("")
f['a']

a    1
b    2
c    3
d    4
e    5
dtype: int64

1

In [11]:
# Example 10: Accessing data from a Series with it's index (label), multiple elements
f = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
print(f)
print("")
f[['a', 'b', 'c']]

a    1
b    2
c    3
d    4
e    5
dtype: int64

a    1
b    2
c    3
dtype: int64

In [12]:
# Example 9: Accessing data from a Series with it's index (label), if a label is non-existent an error is raised
f = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
print(f)
print("")
f['h']

a    1
b    2
c    3
d    4
e    5
dtype: int64

KeyError: 'h'

### DataFrame

DataFrame properties:
- Columns can be different dtypes
- Size is mutable
- Has labeled axes (rows and columns)
- Operations can be performaed accross rows and columns (uses the vectorized operations of NumPy)
- Created from lists, dictonaries, Series, Numpy arrays, or other DataFrames

In [13]:
# Example 1: Create an empty DataFrame
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [14]:
# Example 2: Create a DataFrame from lists
data = [1, 2, 3, 4, 5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [15]:
# Example 3: Create a DataFrame from a list of lists and specify column headers
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [16]:
# Example 4: Create a DataFrame from a list of lists, specify column headers, and specify dtype
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'], dtype=float)
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [17]:
# Example 5: Create a DataFrame from a dictionary of ndarrays/lists
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'], 'Age':[28, 34, 29, 42]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [18]:
# Example 6: Create an indexed DataFrame using arrays
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'], 'Age':[28, 34, 29, 42]}
df = pd.DataFrame(data, index=['rank1', 'rank2', 'rank3', 'rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [19]:
# Example 7: Create a DataFrame from a dictionary of Series
data = {'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
       'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [20]:
# Example 8: Column selection
data = {'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
       'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [21]:
# Example 9: Adding new columns and arithmetic across columns
data = {'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
       'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
print(df)
print("")

# Add new column
df['three'] = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(df)
print("")

# Create new column using arithmetic on existing columns
df['four'] = df['one'] + df['three']
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [22]:
# Example 10: Deleting columns
data = {'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
       'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
       'three':pd.Series([10, 20, 30], index=['a', 'b', 'c'])}
df = pd.DataFrame(data)
print(df)
print("")

# Delete a column
df.pop('two')
print(df)

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

   one  three
a  1.0   10.0
b  2.0   20.0
c  3.0   30.0
d  NaN    NaN

In [23]:
# Example 11: Row selection, addition, and deletion
data = {'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
       'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(data)
print(df)
print("")

# Select specific row, result is a Series with the column names as labels
print(df.loc['b'])
print("")

# Selection by integer location, result is a Series with the column names as labels
print(df.iloc[2])

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

one    2.0
two    2.0
Name: b, dtype: float64

one    3.0
two    3.0
Name: c, dtype: float64

In [24]:
# Example 12: Slice rows
data = {'one':pd.Series([1, 2, 3], index=['a', 'b', 'c']),
       'two':pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)

df[2:4]

   one  two
c  3.0    3
d  NaN    4

In [25]:
# Example 13: Addition of rows from another DataFrame
df = pd.DataFrame([[1, 2], [3, 4]], columns=['a', 'b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=['a', 'b'])

df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [26]:
# Example 14: Deleting rows
df = pd.DataFrame([[1, 2], [3, 4]], columns=['a', 'b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=['a', 'b'])

df = df.append(df2)
print(df)
print("")

df = df.drop(0)  # Drop all rows with index 0, in this case it happens to be multiple rows because there was an index 0 in each DataFrame we appended to each other
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

   a  b
1  3  4
1  7  8

### Series Basic Functionality

In [27]:
# Example 1: Check if a Series is empty
g = pd.Series(np.random.randn(4))
print(g)
print("")

g.empty

0   -2.340760
1    0.833224
2   -1.021213
3    0.577938
dtype: float64

False

In [28]:
# Example 2: Find the number of dimensions of the object
g.ndim

1

In [29]:
# Example 3: Find the size of the object, for a Series that's only going to return the length because all Series are 1D
g.size

4

In [30]:
# Example 4: Return all the values of the Series as an array
g.values

array([-2.34075998,  0.83322414, -1.02121327,  0.57793807])

In [31]:
# Example 5: View the top n rows or bottom n rows of a Series
print(g)
print("")

print(g.head(2))
print("")

print(g.tail(2))

0   -2.340760
1    0.833224
2   -1.021213
3    0.577938
dtype: float64

0   -2.340760
1    0.833224
dtype: float64

2   -1.021213
3    0.577938
dtype: float64

### DataFrame Basic Functionality

In [32]:
# Example 1: Transpose the DataFrame
data = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
        'Age':pd.Series([25,26,25,23,30,29,23]),
        'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
df = pd.DataFrame(data)
print(df)
print("")

print(df.T)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [33]:
# Example 2: Find the DataFrame dtypes
df.dtypes

Name       object
Age         int64
Rating    float64
dtype: object

In [34]:
# Example 3: Check whether the DataFrame object is empty or not
df.empty

False

In [35]:
# Example 4: check for the number of dimensions of the DataFrame
df.ndim

2

In [36]:
# Example 5: Check for the shape of the DataFrame
df.shape

(7, 3)

In [37]:
# Example 6: Check for the size of the DataFrame
df.size  # Returns the number of all values in the DataFrame

21

In [38]:
# Example 7: Return the data in the DataFrame as an ndarray
df.values

array([['Tom', 25, 4.23],
       ['James', 26, 3.24],
       ['Ricky', 25, 3.98],
       ['Vin', 23, 2.56],
       ['Steve', 30, 3.2],
       ['Smith', 29, 4.6],
       ['Jack', 23, 3.8]], dtype=object)

In [39]:
# Example 8: View the top rows and the bottom rows of the DataFrame
# Top 2 rows
print(df.head(2))
print("")

# Bottom 2 rows
print(df.tail(2))

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24

    Name  Age  Rating
5  Smith   29     4.6
6   Jack   23     3.8

### Descriptive Statistics

List of descriptive statistics functions in Pandas:
- .count() for count of non-null values
- .sum() for sum of values
- .mean() for mean of values
- .median() for median of values
- .mode() for mode of values
- .std() for standard deviation of values
- .min() for min value
- .max() for max value
- .abs() for absolute value
- .prod() for product of values
- .cumsum() for cumulative sum of values
- .cumprod for cumulative product of values

In [40]:
# Example 1: Calculate sum of each DataFrame column, string values are appended
# Columns
print(df.sum())  # Default value for axis is 0
print("")

# Rows
print(df.sum(axis=1))

Name      TomJamesRickyVinSteveSmithJack
Age                                  181
Rating                             25.61
dtype: object

0    29.23
1    29.24
2    28.98
3    25.56
4    33.20
5    33.60
6    26.80
dtype: float64

In [41]:
# Example 2: Calculate the mean of each column and row
# Column
print(df.mean())
print("")

# Row
print(df.mean(axis=1))

Age       25.857143
Rating     3.658571
dtype: float64

0    14.615
1    14.620
2    14.490
3    12.780
4    16.600
5    16.800
6    13.400
dtype: float64

In [42]:
# Example 3: Calculate the standard deviation of each row and column
# Column
print(df.std())
print("")

# Row
print(df.std(axis="columns"))

Age       2.734262
Rating    0.698628
dtype: float64

0    14.686608
1    16.093750
2    14.863385
3    14.453263
4    18.950462
5    17.253405
6    13.576450
dtype: float64

In [43]:
# Example 4: Summarize the DataFrame with .describe()
df.describe()

             Age    Rating
count   7.000000  7.000000
mean   25.857143  3.658571
std     2.734262  0.698628
min    23.000000  2.560000
25%    24.000000  3.220000
50%    25.000000  3.800000
75%    27.500000  4.105000
max    30.000000  4.600000

In [44]:
# Example 5: Summarize the string columns with .describe() by including the object dtype
df.describe(include=['object'])

         Name
count       7
unique      7
top     Steve
freq        1

In [45]:
# Example 6: Summarize numerical and string columns using .describe() by including all dtypes
df.describe(include='all')

         Name        Age    Rating
count       7   7.000000  7.000000
unique      7        NaN       NaN
top     Steve        NaN       NaN
freq        1        NaN       NaN
mean      NaN  25.857143  3.658571
std       NaN   2.734262  0.698628
min       NaN  23.000000  2.560000
25%       NaN  24.000000  3.220000
50%       NaN  25.000000  3.800000
75%       NaN  27.500000  4.105000
max       NaN  30.000000  4.600000

### Self-Defined and Other Library Function Application

3 methods to apply your own or another library's functions to Pandas objects:
- Row or column-wise using apply(), applies the function to every column in a DataFrame
- Table-wise using applymap(), applies the function to every element in the DataFrame
- Element-wise using map(), applies the function to every element in a Series

In [46]:
# Define the function to use for this section
def adder(adder1, adder2):
    """The function takes in two values as inputs and returns the sum of those two values."""
    return adder1 + adder2

# Create a DataFrame for this section
df = pd.DataFrame({'Score_Math':pd.Series([66,57,75,44,31,67,85,33,42,62,51,47]),
                   'Score_Science':pd.Series([89,87,67,55,47,72,76,79,44,92,93,69])})
df

    Score_Math  Score_Science
0           66             89
1           57             87
2           75             67
3           44             55
4           31             47
5           67             72
6           85             76
7           33             79
8           42             44
9           62             92
10          51             93
11          47             69

In [47]:
# Example 1: Apply a function to every column in a DataFrame
df.apply(lambda x: x*2)

    Score_Math  Score_Science
0          132            178
1          114            174
2          150            134
3           88            110
4           62             94
5          134            144
6          170            152
7           66            158
8           84             88
9          124            184
10         102            186
11          94            138

In [48]:
# Example 2: Apply a function to each row of a DataFrame
df.apply(lambda x: x*2, axis="columns")

    Score_Math  Score_Science
0          132            178
1          114            174
2          150            134
3           88            110
4           62             94
5          134            144
6          170            152
7           66            158
8           84             88
9          124            184
10         102            186
11          94            138

In [49]:
# Example 3: Apply a function to an entire DataFrame
df.applymap(lambda x: x*2)

    Score_Math  Score_Science
0          132            178
1          114            174
2          150            134
3           88            110
4           62             94
5          134            144
6          170            152
7           66            158
8           84             88
9          124            184
10         102            186
11          94            138

In [50]:
# Example 4: Apply a function to a Series
df['Score_Math'].map(lambda x: x*2)

0     132
1     114
2     150
3      88
4      62
5     134
6     170
7      66
8      84
9     124
10    102
11     94
Name: Score_Math, dtype: int64

### Iteration

- Do NOT try to modify any object while iterating
- Iterating is meant for reading
- The iterator returns a copy of the original object (a view), therefore the changes would not reflect the original object that was iterated over

In [56]:
# Create DataFrame for this section
N=20
df = pd.DataFrame({'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
                   'x': np.linspace(0,stop=N-1,num=N),
                   'y': np.random.rand(N),
                   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
                   'D': np.random.normal(100, 10, size=(N)).tolist()})
df

            A     x         y       C           D
0  2016-01-01   0.0  0.064192     Low  113.211065
1  2016-01-02   1.0  0.126327     Low  128.227264
2  2016-01-03   2.0  0.304508  Medium   87.269279
3  2016-01-04   3.0  0.289285  Medium   96.741476
4  2016-01-05   4.0  0.114401     Low   98.584663
5  2016-01-06   5.0  0.084112     Low  115.857007
6  2016-01-07   6.0  0.679334     Low   91.834363
7  2016-01-08   7.0  0.345454  Medium   92.128786
8  2016-01-09   8.0  0.993551    High  100.243969
9  2016-01-10   9.0  0.472448    High  119.187790
10 2016-01-11  10.0  0.725941    High   85.625343
11 2016-01-12  11.0  0.253201    High   94.356473
12 2016-01-13  12.0  0.802231  Medium   90.654761
13 2016-01-14  13.0  0.812130     Low  107.679106
14 2016-01-15  14.0  0.311612    High  107.961217
15 2016-01-16  15.0  0.739964     Low   86.824823
16 2016-01-17  16.0  0.165301  Medium   98.485677
17 2016-01-18  17.0  0.744105  Medium  101.234150
18 2016-01-19  18.0  0.293741  Medium   99.914390
19 2016-01-20  19.0  0.222790  Medium  101.150605

In [58]:
# Example 1: Iterating over a DataFrame returns column names
for column in df:
    print(column)

A
x
y
C
D

In [60]:
# Example 2: Iterate over each column as a key, value pair with label as key and columns values as a Series using .iteritems()
for key, value in df.iteritems():
    print(key, value)  # Key is column name and value is the entire Series of values in the column

A 0    2016-01-01
1    2016-01-02
2    2016-01-03
3    2016-01-04
4    2016-01-05
5    2016-01-06
6    2016-01-07
7    2016-01-08
8    2016-01-09
9    2016-01-10
10   2016-01-11
11   2016-01-12
12   2016-01-13
13   2016-01-14
14   2016-01-15
15   2016-01-16
16   2016-01-17
17   2016-01-18
18   2016-01-19
19   2016-01-20
Name: A, dtype: datetime64[ns]
x 0      0.0
1      1.0
2      2.0
3      3.0
4      4.0
5      5.0
6      6.0
7      7.0
8      8.0
9      9.0
10    10.0
11    11.0
12    12.0
13    13.0
14    14.0
15    15.0
16    16.0
17    17.0
18    18.0
19    19.0
Name: x, dtype: float64
y 0     0.064192
1     0.126327
2     0.304508
3     0.289285
4     0.114401
5     0.084112
6     0.679334
7     0.345454
8     0.993551
9     0.472448
10    0.725941
11    0.253201
12    0.802231
13    0.812130
14    0.311612
15    0.739964
16    0.165301
17    0.744105
18    0.293741
19    0.222790
Name: y, dtype: float64
C 0        Low
1        Low
2     Medium
3     Medium
4        Low
5        Low
6        Low
7     Medium
8       High
9       High
10      High
11      High
12    Medium
13       Low
14      High
15       Low
16    Medium
17    Medium
18    Medium
19    Medium
Name: C, dtype: object
D 0     113.211065
1     128.227264
2      87.269279
3      96.741476
4      98.584663
5     115.857007
6      91.834363
7      92.128786
8     100.243969
9     119.187790
10     85.625343
11     94.356473
12     90.654761
13    107.679106
14    107.961217
15     86.824823
16     98.485677
17    101.234150
18     99.914390
19    101.150605
Name: D, dtype: float64

In [63]:
# Example 3: Iterate over each row as an index, Series pair, this returns each index value along with a Series containing all of the rows data
for row_index, row in df.iterrows():
    print(row_index, row)  # Because columns can contain different dtypes, this result does not preserve dtype

0 A    2016-01-01 00:00:00
x                      0
y              0.0641916
C                    Low
D                113.211
Name: 0, dtype: object
1 A    2016-01-02 00:00:00
x                      1
y               0.126327
C                    Low
D                128.227
Name: 1, dtype: object
2 A    2016-01-03 00:00:00
x                      2
y               0.304508
C                 Medium
D                87.2693
Name: 2, dtype: object
3 A    2016-01-04 00:00:00
x                      3
y               0.289285
C                 Medium
D                96.7415
Name: 3, dtype: object
4 A    2016-01-05 00:00:00
x                      4
y               0.114401
C                    Low
D                98.5847
Name: 4, dtype: object
5 A    2016-01-06 00:00:00
x                      5
y              0.0841123
C                    Low
D                115.857
Name: 5, dtype: object
6 A    2016-01-07 00:00:00
x                      6
y               0.679334
C                    Low
D                91.8344
Name: 6, dtype: object
7 A    2016-01-08 00:00:00
x                      7
y               0.345454
C                 Medium
D                92.1288
Name: 7, dtype: object
8 A    2016-01-09 00:00:00
x                      8
y               0.993551
C                   High
D                100.244
Name: 8, dtype: object
9 A    2016-01-10 00:00:00
x                      9
y               0.472448
C                   High
D                119.188
Name: 9, dtype: object
10 A    2016-01-11 00:00:00
x                     10
y               0.725941
C                   High
D                85.6253
Name: 10, dtype: object
11 A    2016-01-12 00:00:00
x                     11
y               0.253201
C                   High
D                94.3565
Name: 11, dtype: object
12 A    2016-01-13 00:00:00
x                     12
y               0.802231
C                 Medium
D                90.6548
Name: 12, dtype: object
13 A    2016-01-14 00:00:00
x                     13
y                0.81213
C                    Low
D                107.679
Name: 13, dtype: object
14 A    2016-01-15 00:00:00
x                     14
y               0.311612
C                   High
D                107.961
Name: 14, dtype: object
15 A    2016-01-16 00:00:00
x                     15
y               0.739964
C                    Low
D                86.8248
Name: 15, dtype: object
16 A    2016-01-17 00:00:00
x                     16
y               0.165301
C                 Medium
D                98.4857
Name: 16, dtype: object
17 A    2016-01-18 00:00:00
x                     17
y               0.744105
C                 Medium
D                101.234
Name: 17, dtype: object
18 A    2016-01-19 00:00:00
x                     18
y               0.293741
C                 Medium
D                99.9144
Name: 18, dtype: object
19 A    2016-01-20 00:00:00
x                     19
y                0.22279
C                 Medium
D                101.151
Name: 19, dtype: object

In [64]:
# Example 4: Iterate over the rows as named tuples, returns tuples of each column name and its value
for row in df.itertuples():
    print(row)

Pandas(Index=0, A=Timestamp('2016-01-01 00:00:00'), x=0.0, y=0.06419164857708459, C='Low', D=113.21106489142254)
Pandas(Index=1, A=Timestamp('2016-01-02 00:00:00'), x=1.0, y=0.1263269294303121, C='Low', D=128.22726397598262)
Pandas(Index=2, A=Timestamp('2016-01-03 00:00:00'), x=2.0, y=0.3045078914910726, C='Medium', D=87.26927904547141)
Pandas(Index=3, A=Timestamp('2016-01-04 00:00:00'), x=3.0, y=0.28928546108537867, C='Medium', D=96.74147638025316)
Pandas(Index=4, A=Timestamp('2016-01-05 00:00:00'), x=4.0, y=0.1144011166252441, C='Low', D=98.5846628881929)
Pandas(Index=5, A=Timestamp('2016-01-06 00:00:00'), x=5.0, y=0.0841123362753402, C='Low', D=115.85700664129676)
Pandas(Index=6, A=Timestamp('2016-01-07 00:00:00'), x=6.0, y=0.6793343654381699, C='Low', D=91.83436323710235)
Pandas(Index=7, A=Timestamp('2016-01-08 00:00:00'), x=7.0, y=0.34545412545350407, C='Medium', D=92.12878611704039)
Pandas(Index=8, A=Timestamp('2016-01-09 00:00:00'), x=8.0, y=0.9935511250394489, C='High', D=100.243969054221)
Pandas(Index=9, A=Timestamp('2016-01-10 00:00:00'), x=9.0, y=0.47244842457508873, C='High', D=119.18778958508618)
Pandas(Index=10, A=Timestamp('2016-01-11 00:00:00'), x=10.0, y=0.725941007853048, C='High', D=85.62534286966864)
Pandas(Index=11, A=Timestamp('2016-01-12 00:00:00'), x=11.0, y=0.25320067386038747, C='High', D=94.35647256160942)
Pandas(Index=12, A=Timestamp('2016-01-13 00:00:00'), x=12.0, y=0.8022314494676798, C='Medium', D=90.65476050555766)
Pandas(Index=13, A=Timestamp('2016-01-14 00:00:00'), x=13.0, y=0.8121297975257694, C='Low', D=107.67910593971393)
Pandas(Index=14, A=Timestamp('2016-01-15 00:00:00'), x=14.0, y=0.311611544183926, C='High', D=107.96121697155144)
Pandas(Index=15, A=Timestamp('2016-01-16 00:00:00'), x=15.0, y=0.7399642699092148, C='Low', D=86.82482264705307)
Pandas(Index=16, A=Timestamp('2016-01-17 00:00:00'), x=16.0, y=0.1653010799783433, C='Medium', D=98.4856770149972)
Pandas(Index=17, A=Timestamp('2016-01-18 00:00:00'), x=17.0, y=0.7441048310103083, C='Medium', D=101.23415042423828)
Pandas(Index=18, A=Timestamp('2016-01-19 00:00:00'), x=18.0, y=0.2937412884922367, C='Medium', D=99.91439014770283)
Pandas(Index=19, A=Timestamp('2016-01-20 00:00:00'), x=19.0, y=0.2227900811727399, C='Medium', D=101.15060491531462)

### Sorting

2 types of sorting in Pandas:
- By label
- By actual value

In [71]:
# Creat an unsorted DataFrame for this secion
unsorted_df = pd.DataFrame(np.random.randn(10,2), index=[1, 4, 6, 2, 3, 5, 9, 8, 0, 7], columns=['col2', 'col1'])
unsorted_df  # The labels and values are both unsorted

       col2      col1
1 -0.053005 -1.326003
4 -0.626790  0.650971
6 -0.135019  0.888758
2  1.140913  0.234101
3 -1.618632 -1.036649
5  0.385421 -0.651972
9  0.834500 -0.484687
8  1.098750  0.819317
0  2.114407  1.003065
7 -1.534268 -0.692306

In [72]:
# Example 1: Sort the DataFrame by decreasing index
df_sorted = unsorted_df.sort_index(ascending=False)
df_sorted

       col2      col1
9  0.834500 -0.484687
8  1.098750  0.819317
7 -1.534268 -0.692306
6 -0.135019  0.888758
5  0.385421 -0.651972
4 -0.626790  0.650971
3 -1.618632 -1.036649
2  1.140913  0.234101
1 -0.053005 -1.326003
0  2.114407  1.003065

In [76]:
# Example 2: Sort the columns
df_sorted = unsorted_df.sort_index(axis=1)
df_sorted  # The result is a DataFrame sorted by columns, notice the order now is col1 then col2

       col1      col2
1 -1.326003 -0.053005
4  0.650971 -0.626790
6  0.888758 -0.135019
2  0.234101  1.140913
3 -1.036649 -1.618632
5 -0.651972  0.385421
9 -0.484687  0.834500
8  0.819317  1.098750
0  1.003065  2.114407
7 -0.692306 -1.534268

In [77]:
# Example 3: Sort the rows by specifying axis, instead of setting the ascending parameter
df_sorted = unsorted_df.sort_index(axis=0)
df_sorted  # Notice the rows are now in order after being sorted by index

       col2      col1
0  2.114407  1.003065
1 -0.053005 -1.326003
2  1.140913  0.234101
3 -1.618632 -1.036649
4 -0.626790  0.650971
5  0.385421 -0.651972
6 -0.135019  0.888758
7 -1.534268 -0.692306
8  1.098750  0.819317
9  0.834500 -0.484687

In [83]:
# Create a DataFrame for the next few examples
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})

unsorted_df

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4

In [87]:
# Example 4: Sort by values, this function takes the "by" argument which let's you specify which column to sort by
sorted_df = unsorted_df.sort_values(by='col1')
sorted_df  # This sorted all of the rows based on the value in col1, notice that it did not do any sorting of the col2 values
# Also notice that the row index was altered along with the DataFrame values

   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

In [89]:
# Example 5: Sort by values, but after sorting by one column, sort by the other remaining column, just like you would do with an ORDER BY clause in SQL
sorted_df = unsorted_df.sort_values(by=['col1', 'col2'])
sorted_df  # This sorted first by col1 and then by col2

   col1  col2
2     1     2
1     1     3
3     1     4
0     2     1

### Text Data

In [125]:
# Create a Series to be used for this section
a = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t', np.nan, '1234', 'SteveSmith'])
a

0             Tom
1     William Rick
2             John
3          Alber@t
4              NaN
5             1234
6       SteveSmith
dtype: object

In [126]:
# Example 1: Convert all characters to lowercase
a.str.lower()

0             tom
1     william rick
2             john
3          alber@t
4              NaN
5             1234
6       stevesmith
dtype: object

In [127]:
# Example 2: Convert all characters to uppercase
a.str.upper()

0             TOM
1     WILLIAM RICK
2             JOHN
3          ALBER@T
4              NaN
5             1234
6       STEVESMITH
dtype: object

In [128]:
# Example 3: Check the length of each string
a.str.len()

0     4.0
1    13.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [129]:
# Example 4: Strip outside whitespace
a.str.strip()

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [130]:
# Example 5: Split data based on a specified patters
a.str.split(' ')

0              [Tom, ]
1    [, William, Rick]
2               [John]
3            [Alber@t]
4                  NaN
5               [1234]
6         [SteveSmith]
dtype: object

In [131]:
# Example 6: Concatenate all of the elements with a specified separator
a.str.cat(sep='_')

'Tom _ William Rick_John_Alber@t_1234_SteveSmith'

In [132]:
# Example 7: Find which elements contain a specific pattern
a.str.contains(' ')

0     True
1     True
2    False
3    False
4      NaN
5    False
6    False
dtype: object

In [134]:
# Example 8: Replace all occurances of a pattern with a new patters
a.str.replace('@', '$')

0             Tom
1     William Rick
2             John
3          Alber$t
4              NaN
5             1234
6       SteveSmith
dtype: object

In [135]:
# Example 9: Repeat each value a specific number of times
a.str.repeat(2)

0                      Tom Tom
1     William Rick William Rick
2                      JohnJohn
3                Alber@tAlber@t
4                           NaN
5                      12341234
6          SteveSmithSteveSmith
dtype: object

In [136]:
# Example 10: Count the number of times a specified pattern appears in each string
a.str.count('m')

0    1.0
1    1.0
2    0.0
3    0.0
4    NaN
5    0.0
6    1.0
dtype: float64

In [137]:
# Example 11: Check if each element starts with a specific pattern
a.str.startswith('T')

0     True
1    False
2    False
3    False
4      NaN
5    False
6    False
dtype: object

In [138]:
# Example 12: Check if each element ends with a specific pattern
a.str.endswith('t')

0    False
1    False
2    False
3     True
4      NaN
5    False
6    False
dtype: object

In [139]:
# Example 13: Find the index in the string where a pattern exists
a.str.find('e')  # Notice that a result of -1 means the pattern does not exist

0   -1.0
1   -1.0
2   -1.0
3    3.0
4    NaN
5   -1.0
6    2.0
dtype: float64

In [141]:
# Example 14: Find a list of all occurances where a pattern exists in each element of the Series
a.str.findall('e')  # An empty list of [] menas the pattern was not found

0        []
1        []
2        []
3       [e]
4       NaN
5        []
6    [e, e]
dtype: object

In [143]:
# Example 15: Swap the case of each character in each string in the Series
a.str.swapcase()

0             tOM
1     wILLIAM rICK
2             jOHN
3          aLBER@T
4              NaN
5             1234
6       sTEVEsMITH
dtype: object

In [144]:
# Example 16: Return a boolean based on whether every character in each string is lowercase
a.str.islower()

0    False
1    False
2    False
3    False
4      NaN
5    False
6    False
dtype: object

In [145]:
# Example 17: Return a boolean based on whether every character in each string is uppercase
a.str.isupper()

0    False
1    False
2    False
3    False
4      NaN
5    False
6    False
dtype: object

In [148]:
# Example 18: Return a boolean based on whether the string value in the Series is numeric
a.str.isnumeric()  # Notice it recognized numeric values within the strings

0    False
1    False
2    False
3    False
4      NaN
5     True
6    False
dtype: object

### Indexing and Selecting Data

Due to varying and unexpected data types in real-world scenarios and sometimes the data being accessed isn't known in advance, it is recommended that you use Pandas' optimized data access methods explained in this section for your production code

These include:
- .loc for label-based indexing
- .iloc for integer-based indexing
- .ix for both label and integer-based indexing

In [156]:
# Create a DataFrame for this section
df = pd.DataFrame(np.random.randint(1, 10, size=(8, 4)), index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
a  7  4  2  3
b  2  6  9  3
c  8  8  9  9
d  6  3  3  4
e  6  6  2  3
f  3  8  3  2
g  5  3  4  8
h  5  7  5  9

In [158]:
# Example 1: Use .loc to select specific subsets of a DataFrame, first parameter indicates the row and the second indicates the column
df.loc[:, 'A']  # Returns all rows in column A

a    7
b    2
c    8
d    6
e    6
f    3
g    5
h    5
Name: A, dtype: int32

In [163]:
# Example 2: Select all rows in columns A and C
df.loc[:, ['A', 'C']]

   A  C
a  7  2
b  2  9
c  8  9
d  6  3
e  6  2
f  3  3
g  5  4
h  5  5

In [160]:
# Example 3: Select specific rows, based on index value, and only columns A and C
df.loc[['a', 'b', 'f', 'h'], ['A', 'C']]

   A  C
a  7  2
b  2  9
f  3  3
h  5  5

In [164]:
# Example 4: Select a range of rows for all columns
df.loc['a':'f']

   A  B  C  D
a  7  4  2  3
b  2  6  9  3
c  8  8  9  9
d  6  3  3  4
e  6  6  2  3
f  3  8  3  2

In [166]:
# Example 5: Get a boolean array based on comparison operator
df.loc['a'] > 00

A    True
B    True
C    True
D    True
Name: a, dtype: bool

In [168]:
# Create a DataFrame for the following examples
df = pd.DataFrame(np.random.randint(1, 10, size=(4,4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  2  5  7  5
1  2  5  1  6
2  8  4  7  3
3  8  3  6  8

In [174]:
# Example 6: Select all rows for a specific column
df.iloc[:, 2]

0    7
1    1
2    7
3    6
Name: C, dtype: int32

In [175]:
# Example 7: Select a range of rows and columns using .iloc
df.iloc[1:3, 2:4]

   C  D
1  1  6
2  7  3

In [177]:
# Example 8: Select spcific rows using .iloc
df.iloc[[1, 2, 3]]

   A  B  C  D
1  2  5  1  6
2  8  4  7  3
3  8  3  6  8